In [24]:
#importing libraries
import pandas as pd
import numpy as np

In [25]:
#importing data
products_df = pd.read_csv("products.csv")
sales_df = pd.read_csv("sales.csv")
#data of products
products_df

    sku    name  current_price  cost_price  stock
0  A123  Item A         649.99         500    150
1  B456  Item B         699.00         550     15
2  C789  Item C         999.00         500    250

In [26]:
#sales data
sales_df

    sku  quantity_sold
0  A123             10
1  B456             35
2  C789              0

In [27]:
#merging data for better understanding
merged_df = pd.merge(products_df, sales_df, on="sku", how="left")
merged_df

    sku    name  current_price  cost_price  stock  quantity_sold
0  A123  Item A         649.99         500    150             10
1  B456  Item B         699.00         550     15             35
2  C789  Item C         999.00         500    250              0

In [28]:
#calculating new price as per question
def apply_pricing_rules(row):
    old_price = row['current_price']
    cost_price = row['cost_price']
    stock = row['stock']
    quantity_sold = row['quantity_sold']
    new_price = old_price 
     # Rule 1 – Low Stock, High Demand
    if stock < 20 and quantity_sold > 30:
        new_price = old_price * 1.15
    # Rule 2 – Dead Stock
    elif stock > 200 and quantity_sold == 0:
        new_price = old_price * 0.70
     # Rule 3 – Overstocked Inventory
    elif stock > 100 and quantity_sold < 20:
        new_price = old_price * 0.90
    # Rule 4 - minimum profit constraint
    else:
        minimum_price = cost_price * 1.20
        if new_price < minimum_price:
            new_price = minimum_price

    return f"₹{round(old_price, 2)}", f"₹{round(new_price, 2)}"

In [29]:
# Apply pricing logic
merged_df[["old_price", "new_price"]] = merged_df.apply(apply_pricing_rules, axis=1, result_type="expand")
merged_df

,sku,name,current_price,cost_price,stock,quantity_sold,old_price,new_price
0,A123,Item A,649.99,500,150,10,₹649.99,₹584.99
1,B456,Item B,699.00,550,15,35,₹699.0,₹803.85
2,C789,Item C,999.00,500,250,0,₹999.0,₹699.3

In [30]:
# result output
output_df = merged_df[["sku", "old_price", "new_price"]]
output_df

    sku old_price new_price
0  A123   ₹649.99   ₹584.99
1  B456    ₹699.0   ₹803.85
2  C789    ₹999.0    ₹699.3

In [31]:
# to csv file
output_df.to_csv("updated_prices.csv", index=False)
print( "new pricing saved to updated_prices csv file")

new pricing saved to updated_prices csv file